In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name" : ['Amit','Vicky','Vikash','Sandeep'],
    "Age" : [20,22,25,28],
    "City" : ['Kanpur','Varansi','Odisha','Assam']
}

In [3]:
df = pd.DataFrame(dict1)
#DataFrame me rows and columns hotes hai

In [4]:
df

      Name  Age     City
0     Amit   20   Kanpur
1    Vicky   22  Varansi
2   Vikash   25   Odisha
3  Sandeep   28    Assam

In [5]:
df.to_csv('friends.csv')

#Export this data frame into excel

In [39]:
df.to_csv('friends_index_false.csv',index = False)

#Serial number nahi dikhega

In [7]:
df.head(2)
#First two

    Name  Age     City
0   Amit   20   Kanpur
1  Vicky   22  Varansi

In [8]:
df.tail(2)
#Last two

      Name  Age    City
2   Vikash   25  Odisha
3  Sandeep   28   Assam

In [9]:
df.describe()

         Age
count   4.00
mean   23.75
std     3.50
min    20.00
25%    21.50
50%    23.50
75%    25.75
max    28.00

In [10]:
amit = pd.read_csv('friends.csv')

In [11]:
amit

   Unnamed: 0     Name  Age     City
0           0     Amit   20   Kanpur
1           1    Vicky   22  Varansi
2           2   Vikash   25   Odisha
3           3  Sandeep   28    Assam

In [17]:
ser = pd.Series(np.random.rand(10)) 
#Series me 1 row or 1 column hota hai.

In [18]:
ser

0    0.836503
1    0.067171
2    0.105803
3    0.523887
4    0.260700
5    0.098100
6    0.814473
7    0.670541
8    0.161247
9    0.457720
dtype: float64

In [19]:
type(ser)

pandas.core.series.Series

In [20]:
newdf = pd.DataFrame(np.random.rand(10,2))

In [21]:
newdf

          0         1
0  0.961628  0.718404
1  0.559137  0.665605
2  0.565264  0.953912
3  0.184048  0.705683
4  0.578378  0.774647
5  0.135605  0.788566
6  0.437779  0.476832
7  0.861719  0.809773
8  0.816871  0.432000
9  0.590701  0.136572

In [22]:
type(newdf)

pandas.core.frame.DataFrame

In [23]:
newdf.describe()

               0          1
count  10.000000  10.000000
mean    0.569113   0.646199
std     0.269813   0.236085
min     0.135605   0.136572
25%     0.468119   0.524025
50%     0.571821   0.712044
75%     0.760329   0.785086
max     0.961628   0.953912

In [24]:
newdf.dtypes

0    float64
1    float64
dtype: object

In [25]:
newdf.head()

          0         1
0  0.961628  0.718404
1  0.559137  0.665605
2  0.565264  0.953912
3  0.184048  0.705683
4  0.578378  0.774647

In [26]:
newdf.dtypes

0    float64
1    float64
dtype: object

In [27]:
newdf[0][0] = "Amit"

In [28]:
newdf.head()

          0         1
0      Amit  0.718404
1  0.559137  0.665605
2  0.565264  0.953912
3  0.184048  0.705683
4  0.578378  0.774647

In [29]:
newdf.dtypes

0     object
1    float64
dtype: object

In [32]:
newdf.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
newdf.columns

RangeIndex(start=0, stop=2, step=1)

In [33]:
newdf.to_numpy()

array([['Amit', 0.718404233018901],
       [0.559136921087114, 0.6656051429179622],
       [0.5652638497666339, 0.9539115666403768],
       [0.18404763082078457, 0.7056827985776976],
       [0.57837774112977, 0.7746472839821646],
       [0.1356049102625494, 0.7885656203024453],
       [0.43777931521836466, 0.47683225224940784],
       [0.8617188234096577, 0.8097729901082146],
       [0.8168711313163136, 0.43200029687297925],
       [0.5907007693097568, 0.13657161857664224]], dtype=object)

In [34]:
newdf[0][0] = 0.22

In [35]:
newdf.to_numpy()

array([[0.22, 0.718404233018901],
       [0.559136921087114, 0.6656051429179622],
       [0.5652638497666339, 0.9539115666403768],
       [0.18404763082078457, 0.7056827985776976],
       [0.57837774112977, 0.7746472839821646],
       [0.1356049102625494, 0.7885656203024453],
       [0.43777931521836466, 0.47683225224940784],
       [0.8617188234096577, 0.8097729901082146],
       [0.8168711313163136, 0.43200029687297925],
       [0.5907007693097568, 0.13657161857664224]], dtype=object)

In [36]:
newdf

          0         1
0      0.22  0.718404
1  0.559137  0.665605
2  0.565264  0.953912
3  0.184048  0.705683
4  0.578378  0.774647
5  0.135605  0.788566
6  0.437779  0.476832
7  0.861719  0.809773
8  0.816871  0.432000
9  0.590701  0.136572

In [38]:
newdf.T  #T ranspose kr dega

,0,1,2,3,4,5,6,7,8,9
0,0.22,0.559137,0.565264,0.184048,0.578378,0.135605,0.437779,0.861719,0.816871,0.590701
1,0.718404,0.665605,0.953912,0.705683,0.774647,0.788566,0.476832,0.809773,0.432,0.136572

In [40]:
newdf.head()
#Means it will show some datasets from starting

          0         1
0      0.22  0.718404
1  0.559137  0.665605
2  0.565264  0.953912
3  0.184048  0.705683
4  0.578378  0.774647

In [41]:
newdf.sort_index(axis=1,ascending=False)
#It will reverse

          1         0
0  0.718404      0.22
1  0.665605  0.559137
2  0.953912  0.565264
3  0.705683  0.184048
4  0.774647  0.578378
5  0.788566  0.135605
6  0.476832  0.437779
7  0.809773  0.861719
8  0.432000  0.816871
9  0.136572  0.590701

In [42]:
newdf[0]
#It is a series

0        0.22
1    0.559137
2    0.565264
3    0.184048
4    0.578378
5    0.135605
6    0.437779
7    0.861719
8    0.816871
9    0.590701
Name: 0, dtype: object

In [45]:
newdf2 = newdf
#Here we can consider newdf2 is pointer
# i.e if we make some changes in newdf2 then newdf also changes

In [48]:
newdf3 = newdf.copy()
#or newdf3 = newdf[:]
#in this ,if we make some changes in newdf3 then no change in newdf

In [49]:
newdf.loc[0,0] = 200111

In [50]:
newdf.head(2)

          0         1
0    200111  0.718404
1  0.559137  0.665605

In [51]:
newdf.columns = list("AB")

In [53]:
newdf.loc[0,'A'] = 200111

In [54]:
newdf

          A         B
0    200111  0.718404
1  0.559137  0.665605
2  0.565264  0.953912
3  0.184048  0.705683
4  0.578378  0.774647
5  0.135605  0.788566
6  0.437779  0.476832
7  0.861719  0.809773
8  0.816871  0.432000
9  0.590701  0.136572

In [59]:
newdf.loc[0,0] = 1234
#If column name '0' is not present then it will create a new column with
# column name '0'.

In [60]:
newdf

          A         B       0
0    200111  0.718404  1234.0
1  0.559137  0.665605     NaN
2  0.565264  0.953912     NaN
3  0.184048  0.705683     NaN
4  0.578378  0.774647     NaN
5  0.135605  0.788566     NaN
6  0.437779  0.476832     NaN
7  0.861719  0.809773     NaN
8  0.816871  0.432000     NaN
9  0.590701  0.136572     NaN

In [62]:
newdf = newdf.drop(0,axis = 1)
# It will drop '0' column
# axis = 1 means want to delete column

In [64]:
newdf.loc[[0,1],['A','B']]
#It will give row 0 and 1 and column A and B

          A         B
0    200111  0.718404
1  0.559137  0.665605

In [67]:
# newdf.loc[[0,1],:]
# Gives all the column
# Similarly newdf.loc[:,['A','B']]
# gives all the row

In [69]:
newdf.loc[(newdf['A']<0.3)]
# in the Ath column, gives value less 0.3

          A         B
3  0.184048  0.705683
5  0.135605  0.788566

In [71]:
newdf.iloc[0,1]
# Whether index is named ABC... or 0,1,2.....
#independent of naming of rows or column

0.718404233018901